-- ===========================================
--          额外坐标
-- 请所有贡献者在此处添加额外需要的坐标
-- 
-- 命名规范推荐
--  1. 结构 
--      至多一层的table
--      仅存放数字/字符串/布尔值
--      禁止存放函数
--  2. 分辨率说明   
--      720p无需额外标注
--      1080p请额外的在函数结尾以"_1080p"标注
--  3. 禁止重载point.lua中已有的坐标，避免污染
-- 
-- ===========================================

global_point = {
    活动1 = { 1169, 135 },
    活动2 = { 1166, 225 },

    面板主活动 = { 228, 574 }
}

sandfire_point = {
    退出 = { 44, 38, "FFFFFF" },
    提示 = { 111, 28, "FFFFFF" },
    跳过 = { 1239, 35, "FFFFFF" },
    驻扎地 = { 37, 152, "C9C9C9" },

    奖励 = { 72, 648, "FFFFFF" },

    放弃区域 = { 824, 655, "990000" },
    放弃确认 = { 842, 487 },
    放弃快进 = { 1188, 623, "D7D561" },

    进入演算 = { 1115, 659 },
    进入演算开启状态 = { 1014, 663, "FFFFFF" },
    初始化选择干员 = { 1194, 53, "C9C9C9" },
    干员卡空白区域1 = { 828, 103, "FFFFFF" },
    干员卡空白区域4 = { 836, 522, "FFFFFF" },
    干员卡外部区域1 = { 65, 165, "FF9433" },
    干员卡技能白条 = { 140, 337, "FFFFFF" },
    干员选择确认 = { 1036, 680, "D7D561" },

    全队补充 = { 1217, 656 },

    缩放地图 = { 37, 671 },
    缩放地图进度 = { 39, 647, "D6D560" },

    关卡区域 = { 623, 416, 658, 447, "F0F0F0" },
    -- 作战关卡 = { 633, 424 },
    作战关卡 = { 640, 424 },
    作战信息 = { 1111, 117, "FFFFFF" },
    作战开始 = { 1139, 644 },
    开始行动 = { 1122, 508, "CCCC44" },
    倒计时 = { 607, 57, "CFCFCF" },
    作战暂停 = { 1187, 49, "FFFFFF" },
    作战已暂停 = { 1200, 54, "FFFFFF" },
    离开作战 = { 73, 56 },
    确认离开 = { 957, 417, "FFFFFF" },
    取消确认离开 = { 764, 425, "C5C5C5" },
    离开当前区域 = { 379, 262, "1D1D1D" },
    行动结束 = { 63, 300, "FFFFFF" },
    结算空白区域 = { 1160, 637 },

    下一天 = { 1213, 34 },
    下一天激活 = { 1151, 20, "D8D974" },
    下一天未激活 = { 1194, 24, "161616" },
    下一天紧急 = { 1179, 16, "AA0A09" },
    取消进入下一关 = { 456, 493, "FFFFFF" },

    奖励页面 = { 93, 404, "D6D560" },
    奖励已领完 = { 966, 87, "E0E0E0" },
    一键领取变灰 = { 135, 673, "5E5E5E" },
    跳过皮肤 = { 1222, 34, "FFFFFF" }
}
