tag = {
  "新手", "资深干员", "高级资深干员", "远程位", "近战位",
  "先锋干员", "狙击干员", "医疗干员", "术师干员",
  "近卫干员", "重装干员", "辅助干员", "特种干员", "治疗",
  "支援", "输出", "群攻", "减速", "生存", "防护", "削弱",
  "位移", "控场", "爆发", "召唤", "快速复活", "费用回复",
  "支援机械",
}

--[[ # how to get tag5
# open https://arkn.lolicon.app/#/hr, click 查看保底词条组合, open console and run
let all=[...document.querySelector("#arkn-hr .comb-large table").querySelectorAll('tr')].slice(1)
let ans=''
ans+='{'
all.forEach(line=>{
    let tag=[...line.children[1].querySelectorAll('button')].map(x=>x.textContent)
    let star=line.children[2].textContent.slice(0,1)
    let operator=[...line.children[3].querySelectorAll('span')].map(x=>x.textContent)
    ans+=`{{${tag.map(x=>'"'+x+'"')}},${star},{${operator.map(x=>'"'+x+'"')}}},`
})
ans+='}'
console.log(ans)
--]]

tag5 = {
  {{"控场"}, 5, {"德克萨斯", "梅尔", "红", "格劳克斯"}},
  {{"爆发"}, 5, {"守林人"}}, {{"召唤"}, 5, {"梅尔"}}, {
    {"特种干员"}, 4,
    {
      "红", "槐琥", "崖心", "狮蝎", "食铁兽", "砾", "暗索",
      "阿消",
    },
  }, {
    {"支援"}, 4,
    {"白面鸮", "凛冬", "诗怀雅", "华法琳", "杜宾", "清流"},
  }, {{"削弱"}, 4, {"陨星", "槐琥", "初雪", "夜烟", "流星"}},
  {{"快速复活"}, 4, {"红", "槐琥", "砾"}},
  {{"位移"}, 4, {"可颂", "崖心", "食铁兽", "暗索", "阿消"}},
  {{"近卫干员", "防护"}, 5, {"星极"}},
  {{"重装干员", "输出"}, 5, {"雷蛇", "火神"}},
  {{"重装干员", "生存"}, 5, {"火神"}},
  {{"重装干员", "位移"}, 5, {"可颂"}},
  {{"辅助干员", "输出"}, 5, {"真理"}},
  {{"辅助干员", "削弱"}, 5, {"初雪"}},
  {{"术师干员", "治疗"}, 5, {"夜魔"}},
  {{"特种干员", "输出"}, 5, {"崖心", "狮蝎"}},
  {{"特种干员", "生存"}, 5, {"狮蝎"}},
  {{"特种干员", "减速"}, 5, {"食铁兽"}},
  {{"特种干员", "削弱"}, 5, {"槐琥"}},
  {{"先锋干员", "支援"}, 5, {"凛冬"}},
  {{"治疗", "输出"}, 5, {"夜魔"}}, {{"治疗", "减速"}, 5, {"夜魔"}},
  {{"支援", "费用回复"}, 5, {"凛冬"}},
  {{"输出", "防护"}, 5, {"星极", "雷蛇", "火神"}},
  {{"输出", "位移"}, 5, {"崖心"}}, {{"生存", "防护"}, 5, {"火神"}},
  {{"群攻", "削弱"}, 5, {"陨星"}}, {{"防护", "位移"}, 5, {"可颂"}},
  {{"减速", "位移"}, 5, {"食铁兽"}},
  {{"削弱", "快速复活"}, 5, {"槐琥"}},
  {{"削弱", "近战位"}, 5, {"槐琥"}},
  {{"近卫干员", "减速"}, 4, {"霜叶"}},
  {{"狙击干员", "生存"}, 4, {"杰西卡"}},
  {{"狙击干员", "减速"}, 4, {"梅", "白雪", "安比尔"}},
  {{"术师干员", "减速"}, 4, {"夜魔", "格雷伊"}},
  {{"先锋干员", "治疗"}, 4, {"桃金娘"}},
  {{"治疗", "费用回复"}, 4, {"桃金娘"}},
  {{"输出", "减速"}, 4, {"真理", "夜魔", "梅", "安比尔", "霜叶"}},
  {{"生存", "远程位"}, 4, {"杰西卡"}},
  {{"群攻", "减速"}, 4, {"格雷伊", "白雪"}},
  {{"减速", "近战位"}, 4, {"食铁兽", "霜叶"}},
  {{"术师干员", "输出", "减速"}, 5, {"夜魔"}},
}

table.extend(tag5, {
  {{'支援机械'}, 1, {"支援机械"}},
  {{'资深干员'}, 5, {"资深干员"}},
  {{'高级资深干员'}, 6, {"高级资深干员"}},
  -- {{'生存'}, 0, {"火神"}},
  -- {{'防护'}, 0, {"火神"}},
  -- {{'群功'}, 0, {"火神"}},
})
tagFix = function(x) return x:map({沮 = "狙", 千 = "干"}) end
